[{"School":"USC","CourseName":"CSCI 572: Information Retrieval and Web Search Engines","CourseDesc":"Examines key aspects of information retrieval as they apply to search engines; web crawling, indexing, querying and quality of results are studied."},
{"School":"USC","CourseName":"CSCI 544: Applied Natural Language Processing","CourseDesc":"Introduction to key components of human language technologies, including: information extraction, sentiment analysis, question answering, machine translation."},
{"School":"USC","CourseName":"MUEN 526: Guitar Ensemble","CourseDesc":"Rehearsal and performance of literature composed, transcribed and arranged for small ensembles, including literature for small ensembles of guitar and other instruments, as well as voice."},
{"School":"USC","CourseName":"MUEN 532: Jazz Chamber Music","CourseDesc":"Preparation and performance of advanced literature for jazz chamber groups. Open to graduate students, by audition."},
{"School":"Yale","CourseName":"[The] Law of the Sea","CourseDesc":"This seminar will examine a variety of contemporary issues concerning the Law of the Sea: piracy, environmental protection, fisheries, maritime security, maritime delimitation, the exclusive economic zone, the continental and outer continental shelfs, human rights, unmanned vessels, artificial islands, the South China Sea, and the Arctic region."},
{"School":"Yale","CourseName":"Competition Economics and Policy","CourseDesc":"The course will start by describing the economics underlying the U.S. antitrust laws."},
{"School":"Columbia","CourseName":"COMS 6998.002 ADV WEB DESIGN STUDIO","CourseDesc":"This class uses the principles of human-centered design and the technologies behind web development to teach and practice the art of designing for emerging technologies."},
{"School":"Stanford","CourseName":"CS229: Machine Learning","CourseDesc":"This course provides a broad introduction to machine learning and statistical pattern recognition."},
{"School":"Stanford","CourseName":"CS221: Artificial Intelligence: Principles and Techniques","CourseDesc":"In this course, you will learn the foundational principles and practice implementing various AI systems."},
{"School":"MIT","CourseName":"6.1800 Computer Systems Engineering","CourseDesc":"Topics on the engineering of computer software and hardware systems: techniques for controlling complexity; strong modularity using client-server design, operating systems; performance, networks; naming; security and privacy; fault-tolerant systems, atomicity and coordination of concurrent activities, and recovery; impact of computer systems on society."}]